{
  "style_target": {
    "scenes_per_ep": {
      "suggest": 1.7,
      "range": [
        1,
        3
      ]
    },
    "total_lines_per_ep": {
      "suggest": 28.1,
      "range": [
        22,
        38
      ]
    },
    "dialogue_lines_per_ep": {
      "suggest": 10.28,
      "range": [
        10,
        20
      ]
    },
    "stage_lines_per_ep": {
      "suggest": 14.23,
      "range": [
        8,
        20
      ]
    },
    "vo_os_lines_per_ep": {
      "suggest": 4.34,
      "range": [
        0,
        6
      ]
    }
  },
  "format_spec": {
    "episode_header": "第{ep}集",
    "scene_header_pattern": "{ep}-{scene}场  {place}\\t{day_or_night}\\t{in_or_out}",
    "cast_line_prefix": "人物：",
    "stage_direction_prefix": "▲",
    "dialogue_pattern": "{角色名}：{台词}",
    "allowed_markers": [
      "【切】",
      "【转】",
      "【闪回】",
      "【闪出】"
    ]
  },
  "rules_text": {
    "rhythm_notes": "小说改编短剧（节奏适配关键注意事项）\n小说与短剧的核心差异的是：小说侧重“细节铺垫、心理刻画、慢节奏叙事”，可让读者自主沉浸；短剧侧重“快冲突、强钩子、高爽点”，需被动抓住观众注意力（每10秒必有记忆点）。改编时需重点规避“小说节奏照搬”，核心注意以下5点，确保改编后贴合短剧特质、节奏紧凑：\n1. 主线提纯：砍掉旁支，聚焦1个核心目标（拒绝多线并行）\n小说常有多条支线（配角成长、时代背景、次要情感线），但短剧必须聚焦主角1个核心目标（如前文苏晚“复仇+救母”）。改编时需砍掉无关支线，比如小说中“苏晚的闺蜜情感线”“林浩的童年过往铺垫”，仅保留“与核心目标相关的情节”，避免节奏拖沓。\n示例：若原著中女主复仇线穿插“女主与男二的暧昧支线”，改编时需删除该支线，或让男二成为“助力女主复仇”的工具人，所有戏份都围绕“复仇”展开。\n2. 节奏提速：把“铺垫”转化为“冲突”，拒绝慢热\n小说可花1-2章铺垫背景（如主角的过往、反派的动机），但短剧必须“开篇30秒抛冲突”，无需铺垫。改编时需将小说中的“回忆铺垫、心理描写”，转化为“可视化冲突、直接对话”，快速切入核心。\n示例：原著中花1章写“林浩如何挪用苏家公款、陷害苏父”，改编时无需照搬回忆，可直接在开篇用“苏晚与林浩的对峙台词”（“你挪用我爸公司的钱，害死他”）+“转账记录特写”，10秒交代背景，剩余20秒抛冲突（逼签离婚协议）。\n3. 冲突密集化：拆分小说大冲突，每集都有小冲突+钩子\n小说常围绕1个大冲突展开（如“女主复仇”），中间穿插大量细节描写，冲突爆发节奏慢；但短剧需“每集有独立小冲突，结尾必留钩子”，改编时需将小说的“大冲突拆分”，拆解成10-20个小冲突，对应每一集的核心内容。\n示例：原著中“女主拿到证据、扳倒反派”是1个大冲突，改编时可拆分为“拿到初证→被反派拦截→盟友相助→找到内应线索→二次反击→终极对决”等多个小冲突，每集聚焦1个小冲突，结尾留钩子衔接下一个冲突。\n4. 心理/细节可视化：拒绝大段内心戏，用动作、镜头替代\n小说常用大段内心戏展现主角的情绪（如苏晚的绝望、隐忍、坚定），但短剧是“视觉化媒介”，观众没时间看内心独白。改编时需将“内心戏”转化为“动作、表情、镜头特写”，让情绪直观可感，同时节省时长。\n示例：原著中“苏晚看到证据后，内心从绝望变得坚定，暗暗发誓要复仇”，改编时无需内心独白，可直接用“苏晚眼神从泛红、空洞，慢慢变得锐利”+“攥紧拳头”+“直视反派的动作”，搭配台词“我会让你付出代价”，快速展现情绪变化，贴合短剧节奏。\n5. 保留核心人设+名场面，适配短剧爽点\n改编的核心是“保留原著精髓”，但需适配短剧的“高爽、快节奏”特质。\n①人设不能崩：原著主角的核心特质（如苏晚的隐忍、林浩的阴狠）必须保留，避免观众出戏；\n②名场面优先：原著中最具冲突、最受欢迎的名场面（如“女主当众揭穿反派真面目”），需重点改编，放大爽点，可放在小高潮集（如第3、6、9集）；\n③简化细节：原著中冗长的环境描写、无关对话，可全部删除，所有细节都为“冲突、钩子、爽点”服务。\n总结\n短剧每集的核心逻辑是“30秒勾住→1个核心冲突→1个小反转→1个高光/共情点→结尾强钩子”，6个元素缺一不可；前十集编排需遵循“递进式冲突+紧密钩子衔接”，每集有推进、每3集有高潮，才能让剧情流畅、节奏紧凑，牢牢抓住观众追更；\n小说改编短剧的核心是“提纯主线、提速节奏、冲突密集、视觉化呈现”，既保留原著精髓，又贴合短剧特质，避免照搬小说慢节奏导致观众流失。",
    "end_hook_notes": "设计短剧每集结尾的核心，是用“未完成的冲突+未知的悬念”触发观众的“完形心理”，让他们因“想知道结果”而忍不住追更。\n一、4类核心钩子设计\n1.冲突卡点钩：卡在动作/情绪最高点这是最常用的基础款，关键是在剧情最紧张时戛然而止，不给出结果。\n实操要点：选择“动作进行中”“情绪爆发前”“关键决策时”三个节点，镜头定格或黑屏。\n案例：反派的巴掌即将落在女主脸上、主角举枪对准昔日好友、谈判桌上对方刚说出“我知道你当年的秘密”就切黑屏。原理：利用观众对“完整结果”的渴望，就像说书人“欲知后事如何”的停顿，强制留住注意力。\n2.信息反转钩：抛出颠覆认知的新线索用一句话、一个物品或一个画面，打破之前的剧情设定，让观众重新审视一切。\n实操要点：新信息必须关联核心剧情（身份、真相、动机），且暂时不解释前因后果。\n案例：DNA报告甩在桌上显示“无血缘关系”、神秘人递来的协议写着“你丈夫的死不是意外”、主角发现自己的病历上有陌生的手术记录。原理：瞬间打破观众的认知平衡，激发“这到底是怎么回事”的探索欲。\n危机升级钩：主角陷入新的绝境在当前问题未解决时，抛出更致命的危机，让观众担心主角的命运。\n实操要点：新危机要比上一集的冲突更严重，且关联主角的核心目标（救亲人、复仇、夺遗产）。\n案例：女主刚凑齐手术费就发现医院被反派控制、男主复仇计划即将成功时收到“家人被绑架”的消息、刚被孩子接受的后妈遭遇前夫回归并索要抚养权。原理：通过“越努力越糟糕”的拉扯感，让观众因共情主角而迫切想知道后续解法。\n情感抉择钩：聚焦两难的情感困境针对甜宠、家庭类短剧，用情感冲突让观众代入自身，纠结“该选哪一个”。\n实操要点：设置“二选一”的无解困境，关联主角最在意的人或事。案例：“选我，还是选你的家人”“要救孩子，就得放弃你多年的复仇计划”“这三年，你到底有没有爱过我”。\n原理：情感共鸣比剧情冲突更持久，观众会因“替主角纠结”而追看下一集的抉择。\n实操避坑：3个关键细节（决定钩子效果）\n钩子要“前后呼应”：每集的钩子必须在后续1-2集内解决，同时埋下新钩子，避免“挖坑不填”让观众失望。比如第1集留“神秘人是谁”，第2集揭晓身份后，立刻抛出“他为何帮主角”的新悬念。\n节奏要“密集不拖沓”：短剧单集时长短，钩子不能铺垫太长，建议前3分钟引爆冲突，最后10秒抛出钩子，中间不穿插无关剧情。\n形式要“视觉化”：用镜头语言强化钩子，比如特写主角震惊的表情、关键物品的细节（血迹、文件），搭配音效（心跳声、玻璃碎裂声），比单纯的台词更有冲击力。\n不同题材的钩子侧重（精准匹配观众偏好）\n爽剧/复仇类：多用“冲突卡点钩+信息反转钩”，突出“打脸”“逆袭”的期待感，比如“主角即将揭穿反派真面目时被打断”。\n甜宠/情感类：侧重“情感抉择钩+信息反转钩”，聚焦“偏爱”“误会”，比如“男主刚要表白就看到女主和男二在一起”。\n悬疑/探案类：主打“危机升级钩+信息反转钩”，层层嵌套悬念，比如“刚找到凶手线索，关键证人突然死亡”。\n家庭/现实类：用“冲突卡点钩+情感抉择钩”，贴近生活痛点，比如“婆媳争吵时，丈夫突然拿出离婚协议”。",
    "card_template_notes": "短剧一卡通用模板\n短剧的类型太多了，新手容易被混淆，所以建议先从最典型也是最容易过稿的类型开始写起\n女频：都市甜宠\n男频：都市脑洞\n这两种类型都有个典型特征，就是金手指明确，甜宠类的金手指就是男主，脑洞类的金手指就是系统\n注：一定要写都市，都市类型拍摄成本低，不容易踩红线，更容易过稿\n短剧的第一次付费卡点通常设在第十集，这十集的内容可先用“起承转合”一句话概括，然后进行填充并扩写\n短剧的起承转合：一个什么样的人遇到什么样的变故做出一个什么样的决定（起），于是去做些什么样的事情中间遇到什么样的变故或困难（承），主角通过什么样的努力克服了这些困难（转），最终达到一个什么样的结果（合）\n第一集\n一个什么样的人遇到什么样的变故做出一个什么样的决定（起）\n这一集所有信息量必须要直给，可以调换一下顺序，比如重生类，这个决定可以是在主角死之前立flag，然后再重生，卡住，也可以是主角发现自己重生，立这个flag；比如被催婚的先决定随便找个人结婚得过且过，然后再遇到真命天子（女），其他也一样\n第二集\n于是去做些什么样的事情中间遇到什么样的变故或困难（承），主角通过什么样的努力克服了这些困难（转）\n如果第一集有反派，第二集就通过金手指打脸反派，如果第一集没有反派，第二集一定要出现反派，然后展示金手指的能力打脸反派，定格在反派震惊的画面，\n这里的反派通指跟主角立场对立的人物，当然仇敌或者情敌这类针锋相对的情绪更佳\n顺序同样可以调整，比如重生类的主角通过回忆上一世的一些信息，这些信息就是金手指能力的体现，如果是系统类的那就是主角在确认系统的真实性，然后反派在一旁叫嚣，结尾主角一个态度大反转，甜宠类的话就是反派针对主角之后\n第三集\n最终达到一个什么样的结果（合），于是去做些什么样的事情中间遇到什么样的变故或困难（承）\n这一集简单点说就是延续上一集的结尾然后换个场景主角按计划去执行第一集给的决定结尾来个变故，这个变故可以是之前的反派也可以是新反派，\n短剧中最喜欢的还是这个变故来自旧反派，因为前文有仇恨基础，观众更容易被吸引，当然这个旧反派也可以后面再出现\n第四集\n于是去做些什么样的事情中间遇到什么样的变故或困难（承）\n这一集就是单纯地情绪打压，相当于前三集已经给了一个小高潮后，这里需要有个更大的蓄力以备一卡的爆发，\n需要注意的地方是信息差的建立，特别是面对旧反派的时候，主角前面都已经打脸过反派一次了反派怎么会还傻乎乎的过来找虐，这里就需要反派自我给个理由，比如认为主角只不过是运气好，比如主角的金手指只不过是碰巧发挥了作用\n第五集\n于是去做些什么样的事情中间遇到什么样的变故或困难（承），主角通过什么样的努力克服了这些困难（转）\n第五集最好是有佐证让反派更确信自己的猜测是对的，这样能让反派的气焰更嚣张\n这一集的（转）严格意义上不算是真的转折，可以当成假钩子，或者是预告，比如甜宠类的，女主来到男主公司碰到了女反，不一定男主要到场，可以是女主轻飘飘的一句我就是总裁夫人，甚至都不需要说，女主内心闪过一句话，是他？\n第六集\n于是去做些什么样的事情中间遇到什么样的变故或困难（承），主角通过什么样的努力克服了这些困难（转）\n后续的承和转都跟第五集大差不差，做的都是这种情绪的拉扯，可以变化的地方就是结尾钩子的设计，可以定格在反派得意的瞬间，也可以定格在反派错愕惊恐的瞬间，\n但信息量一定要有，最好是在这一集设计一个倒计时，比如甜宠类的就是男主什么时候到场，重生类的就是一个特定的场合和时间，系统类的可以是系统奖励发放的时间或者说主角的任务进度条\n第七集\n于是去做些什么样的事情中间遇到什么样的变故或困难（承），主角通过什么样的努力克服了这些困难（转）\n第八集\n于是去做些什么样的事情中间遇到什么样的变故或困难（承），主角通过什么样的努力克服了这些困难（转）\n第九集\n于是去做些什么样的事情中间遇到什么样的变故或困难（承），主角通过什么样的努力克服了这些困难（转）\n第十集\n主角通过什么样的努力克服了这些困难（转），最终达到一个什么样的结果（合）"
  },
  "fusion_policy": {
    "numeric": "两套样例取均值做suggest；range取适配1-2分钟/集的可控区间（可拍+高密度）。",
    "rhythm": "以《节奏适配关键注意事项》为硬规则；冲突密度与结尾钩子必须满足。",
    "format": "以两份样例共有格式为准：第N集/场次/人物/▲/角色：台词。"
  }
}